#!/usr/bin/python
# -*- coding: utf-8 -*- #


def get_teachers():
    from database import Logger
    from database.structure import Teachers
    from database.start_db.db_startup import connect_database
    logger = Logger()
    session = connect_database()
    teachers = Teachers.read(session, all_=True)
    teachers.sort(key=unicode)
    for teacher in teachers:
        logger.debug('Teacher: "%s"' % unicode(teacher))


def get_groops():
    from database import Logger
    from database.structure import Groups
    from database.start_db.db_startup import connect_database
    logger = Logger()
    session = connect_database()
    groups = Groups.read(session, all_=True)
    groups.sort(key=unicode)
    for group in groups:
        logger.debug('Group: "%s"' % unicode(group))


department_teachers = {
    u'ТК': [
        u'Павлов Олександр Анатолійович (АСОІтаУ) #5528',
        u'Ігнатенко Валерій Миколайович',
        u'Анікін Володимир Костянтинович',
        u'Бурлаков Володимир Михайлович',
        u'Дзінько Ростислав Ігорович',
        u'Кисленко Юрій Іванович',
        u'Коц С. О.',
        u'Лісовиченко Олег Іванович',
        u'Ліхоузова Тетяна Анатоліївна',
        u'Мелкумян Катерина Юріївна',
        u'Олійник Володимир Валентинович',
        u'Остапченко Костянтин Борисович',
        u'Сирота Олена Петрівна',
        u'Савицький Артем Йосипович',
        u'Польшакова Ольга Михайлівна',
        u'Поліщук Михайло Миколайович',
        u'Пархомей Ігор Ростиславович',
        u'Пасько Віктор Петрович',
        u'Чумаченко Олена Іллівна',
        u'Тимошин Юрій Афанасійович'
    ],
    u'ОТ': [
        u'Балакірова Світлана Юріївна',
        u'Алещенко Олексій Вадимович',
        u'Берест Руслана Юріївна',
        u'Боднарчук Семен Володимирович',
        u'Болдак Андрій Олександрович',
        u'Виноградов Юрій Миколайович',
        u'Волокита Артем Миколайович',
        u'Габинет А В',
        u'Гриша Олена Василівна',
        u'Дімарова Олена Володимирівна',
        u'Долголенко Олександр Миколайович',
        u'Жабін Валерій Іванович (ОТ) #5098',
        u'Жук Віктор Андрійович',
        u'Корнійчук Віктор Іванович (АСОІтаУ, ОТ) #8514',
        u'Корочкін Олександр Володимирович',
        u'Кулаков Юрій Олексійович',
        u'Лубянова Олеся Валеріївна',
        u'Марковський Олександр Петрович',
        u'Мартинюк Яків Васильович',
        u'Мухін Вадим Євгенійович',
        u'Новотарський Михайло Анатолійович',
        u'Ординська Зоя Павлівна',
        u'Панченко Марія Мирославівна',
        u'Порєв Віктор Миколайович',
        u'Праховнік Наталія Артурівна',
        u'Пятова Анжела Вячеславівна',
        u'Радченко К. О.',
        u'Роковий Олександр Петрович',
        u'Саверченко Василь Григорович (ОТ) #5115',
        u'Селіванов Віктор Левович (ОТ) #5110',
        u'Сергієнко Анатолій Михайлович',
        u'Соколова Лариса Федорівна',
        u'Сперкач Майя Олегівна',
        u'Стешин В. В.',
        u'Ткаченко Валентина Василівна'
    ],
    u'АУТС': [
        u'Новацький Анатолій Олександрович',
        u'Теленик Сергій Федорович',
        u'Моргаль Олег Михайлович',
        u'Писаренко Андрій Володимирович',
        u'Репнікова Наталія Борисівна',
        u'Ролік Олександр Іванович',
        u'Юрчук Леонід Юрійович',
        u'Резнік Д. І.',
        u'Амонс Олександр Анатолійович',
        u'Полторак Вадим Петрович (АУТС) #5030',
        u'Букасов Максим Михайлович',
        u'Шимкович Володимир Миколайович',
        u'Покровський Євген Олексійович',
        u'Дорошенко Анатолій Юхимович',
        u'Єфремов Костянтин Вікторович (АПЕПС) #7478',
        u'Долина Віктор Георгійович',
        u'Ульяницька К. О.',
        u'Март Б. А.',
        u'Хмелюк Володимир Сергійович',
        u'Дорошенко Катерина Сергіївна',
        u'Тимофєєва Юлія Сергіївна',
        u'Хмелюк Марина Сергіївна',
        u'Галушко Дмитро Олександрович'
    ],
    u'АСОІУ': [
        u'Баклан І. В.',
        u'Гавриленко Олена Валеріївна',
        u'Коган А. В.',
        u'Жданова Олена Григорівна',
        u'Ковалюк Тетяна Володимирівна',
        u'Новікова Поліна Анатоліївна',
        u'Ліщук Катерина Ігорівна',
        u'Жураковська О. С.',
        u'Муха Ірина Павлівна',
        u'Тєлишева Тамара Олексіївна',
        u'Олійник Ю. О.',
        u'Халус Олена Андріївна',
        u'Тєлишева Тамара Олексіївна'
    ]
}
department_groups = {
    u'ТК': [
        u'ік-31',
        u'ік-32',
        u'ік-33',
        u'ік-41',
        u'ік-42',
        u'ік-51',
        u'ік-52',
        u'ік-61',
        u'ік-61м',
        u'ік-62',
        u'ік-62с',
        u'іт-32',
        u'іт-42',
        u'іт-52',
        u'іт-62'
    ],
    u'ОТ': [
        u'іо-31',
        u'іо-32',
        u'іо-33',
        u'іо-34',
        u'іо-36',
        u'іо-41',
        u'іо-42',
        u'іо-43',
        u'іо-44',
        u'іо-45',
        u'іо-51',
        u'іо-51м',
        u'іо-52',
        u'іо-53',
        u'іо-54',
        u'іо-61',
        u'іо-61м',
        u'іо-62',
        u'іо-62с',
        u'іо-63',
        u'іо-63с',
        u'іо-64',
        u'іо-65',
        u'іп-32',
        u'іп-42',
        u'іп-44',
        u'іп-52',
        u'іп-54',
        u'іп-62',
        u'іп-62м',
        u'іп-64'
    ],
    u'АУТС': [
        u'іа-31',
        u'іа-32',
        u'іа-33',
        u'іа-41',
        u'іа-42',
        u'іа-51',
        u'іа-52',
        u'іа-61',
        u'іа-61м',
        u'іа-62',
        u'іа-62с',
        u'іт-31',
        u'іт-41',
        u'іт-51',
        u'іт-61'
    ],
    u'АСОІУ': [
        u'іс-31',
        u'іс-32',
        u'іс-33',
        u'іс-41',
        u'іс-42',
        u'іс-43',
        u'іс-51',
        u'іс-52',
        u'іс-53',
        u'іс-61',
        u'іс-61м',
        u'іс-62',
        u'іс-62с',
        u'іс-63',
        u'іс-63м',
        u'іп-31',
        u'іп-41',
        u'іп-43',
        u'іп-51',
        u'іп-53',
        u'іп-61',
        u'іп-61м',
        u'іп-63',
        u'іп-63с'
    ]
}

department_rooms = {
    u'ТК': [
    ],
    u'ОТ': [
    ],
    u'АУТС': [
    ],
    u'АСОІУ': [
    ]
}


if __name__ == '__main__':
    # get_teachers()
    get_groops()
